[
  { "id": "S7", "cat": "security", "q": "Role-Based Access Control (RBAC) assigns permissions to:", "options": ["Individual users based on their specific daily tasks", "Roles, which are then assigned to users", "Data objects based on their security classification level", "Network segments to restrict physical access", "Active Directory groups based on geographic location"], "a": 1, "expl": "RBAC scales by managing permissions on Roles, reducing administrative overhead.", "prep": "DMBOK2 Ch. 7: RBAC.", "ref": "DMBOK2 Ch. 7" },
  { "id": "S8", "cat": "security", "q": "What does 'Non-Repudiation' guarantee?", "options": ["Data cannot be altered in transit between two systems", "The sender cannot deny having sent the message or performed the action", "The system will remain available even during a denial-of-service attack", "A user's identity is completely anonymized in the audit logs", "Data backups cannot be corrupted by ransomware"], "a": 1, "expl": "Proof of origin/delivery preventing denial of action.", "prep": "DMBOK2 Ch. 7: Security Goals.", "ref": "DMBOK2 Ch. 7" },
  { "id": "S9", "cat": "security", "q": "A 'Firewall' is an example of which type of security control?", "options": ["Administrative Control", "Physical Control", "Technical / Logical Control", "Detective Control", "Compensating Control"], "a": 2, "expl": "Firewalls are software/hardware devices implementing technical rules (Logical).", "prep": "DMBOK2 Ch. 7: Control Types.", "ref": "DMBOK2 Ch. 7" },
  { "id": "S10", "cat": "security", "q": "Which regulation impacts the handling of US Healthcare data (PHI)?", "options": ["General Data Protection Regulation (GDPR)", "Health Insurance Portability and Accountability Act (HIPAA)", "Sarbanes-Oxley Act (SOX)", "Payment Card Industry Data Security Standard (PCI-DSS)", "Family Educational Rights and Privacy Act (FERPA)"], "a": 1, "expl": "HIPAA = US Healthcare. SOX = Finance. PCI = Credit Cards.", "prep": "DMBOK2 Ch. 7: Regulations.", "ref": "DMBOK2 Ch. 7" },
  { "id": "S11", "cat": "security", "q": "What is 'Phishing'?", "options": ["Exploiting a vulnerability in a web application's input fields", "A social engineering attack via electronic communication to steal credentials", "Intercepting unencrypted data packets over a public Wi-Fi network", "Using automated tools to guess passwords via brute force", "Gaining unauthorized physical access by tailgating an employee"], "a": 1, "expl": "Phishing is a social engineering attack focusing on human deception.", "prep": "DMBOK2 Ch. 7: Threats.", "ref": "DMBOK2 Ch. 7" },
  { "id": "S12", "cat": "security", "q": "Tokenization replaces sensitive data with:", "options": ["A mathematically irreversible hash value", "Non-sensitive surrogates (tokens) that map back to the original via a secure vault", "Ciphertext generated using a public key infrastructure (PKI)", "Masked characters (e.g., replacing the first 12 digits of a credit card with 'X')", "Synthetic data generated by a machine learning algorithm"], "a": 1, "expl": "Tokens allow systems to process data without exposing real values, reversible only by the token vault.", "prep": "DMBOK2 Ch. 7: Tokenization.", "ref": "DMBOK2 Ch. 7" },
  { "id": "S13", "cat": "security", "q": "Which is a 'Physical' security control?", "options": ["A mandatory password rotation policy", "An Intrusion Detection System (IDS)", "A biometric scanner at the entrance to a server room", "A Virtual Private Network (VPN) requirement for remote workers", "An Access Control List (ACL) on a network router"], "a": 2, "expl": "Tangible barriers preventing physical access.", "prep": "DMBOK2 Ch. 7: Controls.", "ref": "DMBOK2 Ch. 7" },
  { "id": "S14", "cat": "security", "q": "Multi-Factor Authentication (MFA) requires factors from at least how many categories?", "options": ["One category, provided it is a biometric factor", "Two or more distinct categories (e.g., knowledge, possession, inherence)", "Three distinct categories, including a physical hardware token", "Two factors from the same category (e.g., two different passwords)", "It depends entirely on the data classification level"], "a": 1, "expl": "Two or more (e.g., Something you know + Something you have).", "prep": "DMBOK2 Ch. 7: MFA.", "ref": "DMBOK2 Ch. 7" },
  { "id": "S15", "cat": "security", "q": "What is the purpose of a 'Demilitarized Zone' (DMZ) in network security?", "options": ["To physically isolate database servers in a separate, locked room", "To expose public-facing services to an untrusted network while isolating the internal network", "To encrypt all data at rest before it is moved to cloud storage", "To serve as a honeypot to attract and trap malicious hackers", "To bypass firewall rules for executive-level employees"], "a": 1, "expl": "DMZ creates a buffer zone between the public internet and the private trusted network.", "prep": "DMBOK2 Ch. 7: Network Security.", "ref": "DMBOK2 Ch. 7" },
  { "id": "MD1", "cat": "mdm", "q": "Which of the following is the BEST example of Reference Data?", "options": ["A specific customer profile (e.g., John Doe)", "A unique product identifier (e.g., SKU 12345)", "A standardized list of ISO Country Codes (e.g., US, DE, FR)", "A daily sales transaction record", "A monthly aggregated financial report"], "a": 2, "expl": "Reference data defines the set of permissible values (codes, lookups).", "prep": "DMBOK2 Ch. 10: Ref vs Master.", "ref": "DMBOK2 Ch. 10" },
  { "id": "MD2", "cat": "mdm", "q": "What is the primary goal of Entity Resolution (Match and Merge)?", "options": ["To standardize the format of addresses across all systems", "To identify if multiple records across systems refer to the same real-world object", "To enforce referential integrity between fact and dimension tables", "To automatically correct spelling errors in customer names", "To generate a unique surrogate key for every new transaction"], "a": 1, "expl": "Identifying duplicates across disparate sources to create a single view.", "prep": "DMBOK2 Ch. 10: Entity Resolution.", "ref": "DMBOK2 Ch. 10" },
  { "id": "MD3", "cat": "mdm", "q": "In MDM, what characterizes a 'Registry' style architecture?", "options": ["The hub stores a complete, consolidated 'Golden Record' with all attributes", "The hub stores only identifiers and cross-references, leaving the actual data in source systems", "Master data is authored directly in the hub and pushed to downstream systems", "The hub acts as a real-time transactional database for all enterprise applications", "Data is synchronized bidirectionally between the hub and all source systems in real-time"], "a": 1, "expl": "Registry holds pointers/IDs and cross-references, but data remains in source systems.", "prep": "DMBOK2 Ch. 10: Architecture.", "ref": "DMBOK2 Ch. 10" },
  { "id": "MD4", "cat": "mdm", "q": "Which MDM style allows authoring of master data directly in the central hub, making it the System of Record?", "options": ["Registry Style", "Consolidated Style", "Transaction / Centralized Style", "Coexistence Style", "Federated Style"], "a": 2, "expl": "Transaction/Centralized hub implies the hub is the authoritative source for creation/edits.", "prep": "DMBOK2 Ch. 10: Architecture.", "ref": "DMBOK2 Ch. 10" },
  { "id": "MD5", "cat": "mdm", "q": "What are 'Survivorship' rules used for in MDM?", "options": ["To determine the data retention period before archival", "To determine the 'winning' value for an attribute when merging conflicting records", "To establish which source system is allowed to create new master records", "To define the failover process for the MDM hub during a disaster", "To calculate the confidence score during probabilistic matching"], "a": 1, "expl": "Survivorship logic creates the Golden Record by picking the best values from sources.", "prep": "DMBOK2 Ch. 10: Survivorship.", "ref": "DMBOK2 Ch. 10" },
  { "id": "MD6", "cat": "mdm", "q": "Master Data typically describes:", "options": ["The events and actions of the business (e.g., Sales, Deliveries)", "The core entities of the business (e.g., Customers, Products, Locations)", "The descriptive context of the data (e.g., Data Types, Lineage)", "The aggregated performance metrics (e.g., Quarterly Revenue)", "The allowable values for a specific field (e.g., Status Codes)"], "a": 1, "expl": "Master data represents the core entities (Nouns) involved in transactions.", "prep": "DMBOK2 Ch. 10: Definition.", "ref": "DMBOK2 Ch. 10" },
  { "id": "MD7", "cat": "mdm", "q": "Taxonomies and Ontologies are tools primarily used in managing:", "options": ["High-velocity streaming data", "Reference Data, Vocabularies, and Knowledge Graphs", "Physical database schemas and DDL scripts", "Role-Based Access Control (RBAC) policies", "Data warehouse ETL transformation logic"], "a": 1, "expl": "They structure classification and meaning, core to Reference Data.", "prep": "DMBOK2 Ch. 10: Taxonomies.", "ref": "DMBOK2 Ch. 10" },
  { "id": "MD8", "cat": "mdm", "q": "Probabilistic Matching uses what mechanism to identify duplicates?", "options": ["Deterministic rules based on exact string equality (e.g., SSN = SSN)", "Statistical algorithms and scoring weights to determine the likelihood of a match", "Manual review by Data Stewards for every potential duplicate", "Referential integrity constraints enforced by the database engine", "Standardization routines that format all data identically before comparison"], "a": 1, "expl": "Fuzzy logic/scores determine the likelihood of a match.", "prep": "DMBOK2 Ch. 10: Matching.", "ref": "DMBOK2 Ch. 10" },
  { "id": "MD9", "cat": "mdm", "q": "Which of the following is NOT a common Master Data domain?", "options": ["Customer / Party", "Product / Service", "Location / Geography", "Financial Account", "Point-of-Sale Transaction"], "a": 4, "expl": "Logs are event/transaction data, not master entities.", "prep": "DMBOK2 Ch. 10: Domains.", "ref": "DMBOK2 Ch. 10" },
  { "id": "MD10", "cat": "mdm", "q": "Who is responsible for defining valid values and business definitions for Reference Data sets?", "options": ["Enterprise Data Architects", "Business Data Stewards", "Database Administrators (DBAs)", "The Chief Information Officer (CIO)", "The Master Data Management (MDM) software vendor"], "a": 1, "expl": "Stewards manage the content and business rules for data.", "prep": "DMBOK2 Ch. 10: Governance.", "ref": "DMBOK2 Ch. 10" },
  { "id": "DW1", "cat": "dwbi", "q": "OLAP stands for:", "options": ["Online Analytical Processing", "Online Transaction Processing", "Operational Logical Application Processing", "Optimized Linear Analytics Protocol", "Object-Level Access Protocol"], "a": 0, "expl": "OLAP is for analysis. OLTP is for transactions.", "prep": "DMBOK2 Ch. 11: Acronyms.", "ref": "DMBOK2 Ch. 11" },
  { "id": "DW2", "cat": "dwbi", "q": "Bill Inmon's definition of a Data Warehouse includes all of the following characteristics EXCEPT:", "options": ["Subject-Oriented", "Integrated", "Time-Variant", "Non-Volatile", "Volatile (Continuously updated in real-time)"], "a": 4, "expl": "Inmon defines DW as Non-Volatile. 'Volatile' is incorrect.", "prep": "DMBOK2 Ch. 11: Inmon.", "ref": "DMBOK2 Ch. 11" },
  { "id": "DW3", "cat": "dwbi", "q": "What is 'Slicing and Dicing'?", "options": ["Partitioning a large fact table horizontally to improve query performance", "Navigating a multi-dimensional OLAP cube by filtering and grouping dimensions", "Removing personally identifiable information (PII) from a dataset", "Extracting data from a source system and loading it into a staging area", "Normalizing a denormalized table into Third Normal Form (3NF)"], "a": 1, "expl": "Standard interaction with multi-dimensional data (OLAP).", "prep": "DMBOK2 Ch. 11: OLAP.", "ref": "DMBOK2 Ch. 11" },
  { "id": "DW4", "cat": "dwbi", "q": "Which schema typically involves normalizing dimensions into multiple related tables?", "options": ["Star Schema", "Snowflake Schema", "Fact Constellation Schema", "Data Vault Schema", "Third Normal Form (3NF) Schema"], "a": 1, "expl": "Snowflake normalizes dimensions to remove redundancy, unlike Star.", "prep": "DMBOK2 Ch. 11: Schema.", "ref": "DMBOK2 Ch. 11" },
  { "id": "DW5", "cat": "dwbi", "q": "A Data Mart is best described as:", "options": ["The centralized, integrated repository for all enterprise historical data", "A subset of a data warehouse focused on a specific subject area or department", "A staging area used exclusively for data cleansing and transformation", "A real-time operational data store (ODS) used for transaction processing", "A data lake designed to store raw, unstructured data"], "a": 1, "expl": "Marts are subject-oriented subsets (e.g., Marketing Mart).", "prep": "DMBOK2 Ch. 11: Marts.", "ref": "DMBOK2 Ch. 11" },
  { "id": "DW6", "cat": "dwbi", "q": "CDC stands for:", "options": ["Centralized Data Catalog", "Change Data Capture", "Continuous Data Cleansing", "Customer Data Consolidation", "Critical Data Classification"], "a": 1, "expl": "CDC identifies and captures changes in source systems for ETL.", "prep": "DMBOK2 Ch. 11: CDC.", "ref": "DMBOK2 Ch. 11" },
  { "id": "DW7", "cat": "dwbi", "q": "What is the 'Staging Area' in a DW architecture?", "options": ["The semantic layer where business users access finalized reports", "A temporary storage area where raw data lands before transformation and loading", "The permanent archive for historical data that is rarely accessed", "The operational system where transactions are initially recorded", "The dimensional model containing the fact and dimension tables"], "a": 1, "expl": "Buffer zone for extraction and preliminary cleaning.", "prep": "DMBOK2 Ch. 11: Architecture.", "ref": "DMBOK2 Ch. 11" },
  { "id": "DW8", "cat": "dwbi", "q": "R-OLAP refers to:", "options": ["Relational OLAP (querying data directly from relational tables)", "Real-time OLAP (processing data streams in memory)", "Remote OLAP (accessing cubes hosted in a cloud environment)", "Robust OLAP (providing high availability and disaster recovery)", "Multidimensional OLAP (storing data in proprietary cube structures)"], "a": 0, "expl": "ROLAP leaves data in relational tables; MOLAP uses cubes.", "prep": "DMBOK2 Ch. 11: OLAP Types.", "ref": "DMBOK2 Ch. 11" },
  { "id": "DW9", "cat": "dwbi", "q": "Kimball's Data Warehouse methodology is often described as:", "options": ["Top-Down (building the Enterprise Data Warehouse first)", "Bottom-Up (building dimensional Data Marts connected by a bus architecture)", "Data Vault (using hubs, links, and satellites)", "Data Mesh (decentralized, domain-oriented data products)", "Schema-on-Read (storing raw data in a Data Lake)"], "a": 1, "expl": "Kimball = Bottom-Up (Bus Matrix). Inmon = Top-Down (CIF).", "prep": "DMBOK2 Ch. 11: Methodologies.", "ref": "DMBOK2 Ch. 11" },
  { "id": "DW10", "cat": "dwbi", "q": "Ungoverned Self-Service BI primarily risks creating:", "options": ["Data silos, inconsistent business definitions, and 'Spreadmarts'", "Overly restrictive data security policies that hinder access", "A bottleneck in the IT department due to report requests", "An overly complex Enterprise Data Warehouse architecture", "Excessive documentation and metadata management overhead"], "a": 0, "expl": "Without governance, users create conflicting definitions and reports.", "prep": "DMBOK2 Ch. 11: Risks.", "ref": "DMBOK2 Ch. 11" },
  { "id": "ME1", "cat": "metadata", "q": "Which is an example of 'Business Metadata'?", "options": ["The physical data type of a column (e.g., VARCHAR(50))", "The mapping rules used in an ETL process", "The agreed-upon definition and calculation for 'Active Customer'", "The execution logs and row counts from the nightly batch job", "The index structures applied to a relational database table"], "a": 2, "expl": "Context/Definition for business users. Others are Technical/Operational.", "prep": "DMBOK2 Ch. 12: Types.", "ref": "DMBOK2 Ch. 12" },
  { "id": "ME2", "cat": "metadata", "q": "Which is an example of 'Technical Metadata'?", "options": ["The name of the Data Owner accountable for a dataset", "The business policy governing data retention", "The physical database schema, column lengths, and data types", "The glossary definition of a specific business term", "The data quality score displayed on an executive dashboard"], "a": 2, "expl": "Physical structure details used by developers/DBAs.", "prep": "DMBOK2 Ch. 12: Types.", "ref": "DMBOK2 Ch. 12" },
  { "id": "ME3", "cat": "metadata", "q": "Data Lineage describes:", "options": ["The hierarchical relationship between a parent entity and its child entities", "The path data takes from origin to destination, including all transformations", "The historical record of which users accessed a specific data element", "The statistical distribution and profiling results of a dataset", "The organizational reporting structure of the Data Governance team"], "a": 1, "expl": "Flow/Transformation history (Where did it come from?).", "prep": "DMBOK2 Ch. 12: Lineage.", "ref": "DMBOK2 Ch. 12" },
  { "id": "ME4", "cat": "metadata", "q": "A Business Glossary is primarily used to:", "options": ["Document the physical table structures and foreign key relationships", "Align business terminology, definitions, and concepts across the enterprise", "Store the technical mapping rules for the ETL processes", "Manage the access control lists (ACLs) for the data warehouse", "Track the operational execution logs of data integration jobs"], "a": 1, "expl": "Shared vocabulary to prevent semantic confusion.", "prep": "DMBOK2 Ch. 12: Glossary.", "ref": "DMBOK2 Ch. 12" },
  { "id": "ME5", "cat": "metadata", "q": "Operational Metadata includes:", "options": ["The business definitions of key performance indicators (KPIs)", "Execution logs, processing times, error rates, and row counts", "The logical data models and entity-relationship diagrams", "The data stewardship assignments and RACI matrices", "The physical data types and constraints of database columns"], "a": 1, "expl": "Run-time stats generated during processing.", "prep": "DMBOK2 Ch. 12: Types.", "ref": "DMBOK2 Ch. 12" },
  { "id": "ME6", "cat": "metadata", "q": "What is a 'Metadata Repository'?", "options": ["A staging area used to temporarily hold data before it enters the data warehouse", "A centralized database or system specifically designed to store and manage metadata", "A document management system used to store PDF versions of data policies", "A physical server rack dedicated to hosting the Master Data Management hub", "A data lake zone reserved for unstructured log files"], "a": 1, "expl": "The system of record for metadata.", "prep": "DMBOK2 Ch. 12: Architecture.", "ref": "DMBOK2 Ch. 12" }
]
