[
  { "id": "ME7", "cat": "metadata", "q": "Which standard is related to Metadata exchange?", "options": ["Extensible Markup Language (XML) Schema Definition (XSD)", "JavaScript Object Notation (JSON)", "Common Warehouse Metamodel (CWM) / XML Metadata Interchange (XMI)", "Simple Object Access Protocol (SOAP)", "Representational State Transfer (REST)"], "a": 2, "expl": "CWM/XMI/ISO 11179 are metadata standards.", "prep": "DMBOK2 Ch. 12: Standards.", "ref": "DMBOK2 Ch. 12" },
  { "id": "ME8", "cat": "metadata", "q": "Impact Analysis helps to:", "options": ["Determine the root cause of a data quality failure in a source system", "Determine the downstream effects of changing a data element or structure", "Calculate the financial return on investment (ROI) for a data governance program", "Identify the optimal hardware configuration for a new database server", "Assess the risk of a potential data breach before it occurs"], "a": 1, "expl": "Lineage allows you to see what breaks if you change a column.", "prep": "DMBOK2 Ch. 12: Usage.", "ref": "DMBOK2 Ch. 12" },
  { "id": "ME9", "cat": "metadata", "q": "What is a 'Metamodel'?", "options": ["A data model that describes the structure and rules of the metadata repository itself", "A consolidated enterprise logical data model that spans all business units", "A conceptual framework used to design the physical data warehouse architecture", "A predictive machine learning model used to automatically classify new data assets", "A standardized template used for documenting business glossaries"], "a": 0, "expl": "The schema that defines how metadata is stored.", "prep": "DMBOK2 Ch. 12: Metamodel.", "ref": "DMBOK2 Ch. 12" },
  { "id": "ME10", "cat": "metadata", "q": "Effective Metadata Management enables:", "options": ["Self-service data access and increased trust in data assets", "The complete elimination of all data silos across the enterprise", "Automated, real-time correction of all data quality errors", "The replacement of traditional data warehouses with data lakes", "A reduction in the need for dedicated data stewards"], "a": 0, "expl": "Context = Trust. Users can find and understand data.", "prep": "DMBOK2 Ch. 12: Benefits.", "ref": "DMBOK2 Ch. 12" },
  { "id": "DC1", "cat": "content", "q": "Unstructured data accounts for roughly what % of enterprise data?", "options": ["10-20%", "30-40%", "50%", "80-90%", "Nearly 100%"], "a": 3, "expl": "The '80/20 rule' applies: ~80% of data is unstructured.", "prep": "DMBOK2 Ch. 9.", "ref": "DMBOK2 Ch. 9" },
  { "id": "DC2", "cat": "content", "q": "A 'Taxonomy' is:", "options": ["A flat, uncontrolled vocabulary of tags created by end-users", "A hierarchical classification of terms representing parent-child relationships", "A legal framework governing the taxation of digital assets", "A physical index structure used to optimize database queries", "A set of rules defining how data should be archived"], "a": 1, "expl": "Hierarchy/Tree structure used for classification.", "prep": "DMBOK2 Ch. 9.", "ref": "DMBOK2 Ch. 9" },
  { "id": "DC3", "cat": "content", "q": "eDiscovery refers to:", "options": ["The automated profiling of new data sources added to a data lake", "The process of identifying, preserving, and collecting electronic data for legal evidence", "The use of artificial intelligence to uncover hidden patterns in customer behavior", "The process of mapping legacy data structures to a new target schema", "The proactive scanning of networks for unauthorized data exfiltration"], "a": 1, "expl": "Legal search for electronic records.", "prep": "DMBOK2 Ch. 9.", "ref": "DMBOK2 Ch. 9" },
  { "id": "DC4", "cat": "content", "q": "What does OCR stand for?", "options": ["Optical Character Recognition", "Object Content Repository", "Online Customer Record", "Operational Control Requirement", "Organizational Change Readiness"], "a": 0, "expl": "Technology to convert images of text into machine-encoded text.", "prep": "DMBOK2 Ch. 9.", "ref": "DMBOK2 Ch. 9" },
  { "id": "DC5", "cat": "content", "q": "Records Management is primarily concerned with:", "options": ["Optimizing the performance of the enterprise data warehouse", "The lifecycle management (retention and disposal) of evidence and official records", "The creation and distribution of marketing collateral", "The technical administration of document management software", "The real-time processing of transactional data streams"], "a": 1, "expl": "Managing the legal lifecycle and retention schedules of records.", "prep": "DMBOK2 Ch. 9.", "ref": "DMBOK2 Ch. 9" },
  { "id": "DC6", "cat": "content", "q": "A 'Folksonomy' is created by:", "options": ["A centralized committee of subject matter experts and taxonomists", "Users collaboratively tagging content (crowdsourced or social tagging)", "Mandatory industry regulations and compliance standards", "Automated natural language processing (NLP) algorithms", "The database administrators who design the physical schema"], "a": 1, "expl": "Social classification (e.g., hashtags).", "prep": "DMBOK2 Ch. 9.", "ref": "DMBOK2 Ch. 9" },
  { "id": "DC7", "cat": "content", "q": "Metadata embedded directly within a file (like EXIF data in a photograph) is known as:", "options": ["Embedded Metadata", "External Metadata", "System Metadata", "Business Metadata", "Administrative Metadata"], "a": 0, "expl": "Stored inside the file header itself.", "prep": "DMBOK2 Ch. 9.", "ref": "DMBOK2 Ch. 9" },
  { "id": "DC8", "cat": "content", "q": "Which lifecycle phase involves the legally mandated destruction of records?", "options": ["Creation and Receipt", "Active Use and Maintenance", "Disposal / Disposition", "Inactive Storage and Archival", "Classification and Indexing"], "a": 2, "expl": "Secure destruction according to retention schedules.", "prep": "DMBOK2 Ch. 9.", "ref": "DMBOK2 Ch. 9" },
  { "id": "ET1", "cat": "ethics", "q": "GDPR's 'Right to Explanation' concerns:", "options": ["Understanding the logic and consequences of an automated decision (e.g., AI) made about a person", "The requirement for companies to publish their data retention schedules publicly", "The right of a user to know the physical location of the servers storing their data", "The obligation to disclose the financial cost of processing a data subject access request", "The requirement to explain the technical architecture of the data warehouse to regulators"], "a": 0, "expl": "Transparency in Algorithmic decision making.", "prep": "DMBOK2 Ch. 2: AI Ethics.", "ref": "DMBOK2 Ch. 2" },
  { "id": "ET2", "cat": "ethics", "q": "Bias in AI models often stems from:", "options": ["Syntax errors in the underlying programming code", "Biased training data that reflects historical prejudices or systemic inequalities", "Insufficient processing power during the model training phase", "The use of open-source machine learning libraries instead of proprietary ones", "Overly strict data security protocols that limit access to the full dataset"], "a": 1, "expl": "Bias In = Bias Out. Models learn historical prejudices.", "prep": "DMBOK2 Ch. 2: Bias.", "ref": "DMBOK2 Ch. 2" },
  { "id": "ET3", "cat": "ethics", "q": "Simpson's Paradox illustrates a situation where:", "options": ["Data quality improves as the volume of data increases", "Aggregated data can hide or reverse trends that are clearly present in the underlying subgroups", "Increasing data security inevitably decreases data availability", "The cost of storing data eventually exceeds the value derived from it", "Anonymized data can always be re-identified using external datasets"], "a": 1, "expl": "Statistical paradox where aggregation hides the truth.", "prep": "DMBOK2 Ch. 2: Paradoxes.", "ref": "DMBOK2 Ch. 2" },
  { "id": "ET4", "cat": "ethics", "q": "Data Ethics is distinct from Data Privacy because:", "options": ["Privacy focuses on legal compliance ('Can we?'), while Ethics focuses on moral obligation ('Should we?')", "Privacy applies only to structured data, while Ethics applies to unstructured data", "Privacy is a concern only in Europe (GDPR), while Ethics is a global standard", "Ethics is a technical discipline, while Privacy is a business discipline", "Ethics is entirely optional, whereas Privacy is strictly mandatory"], "a": 0, "expl": "Compliance asks 'Can we?'; Ethics asks 'Should we?'.", "prep": "DMBOK2 Ch. 2: Distinction.", "ref": "DMBOK2 Ch. 2" },
  { "id": "ET5", "cat": "ethics", "q": "What is 'Consent' in the context of data ethics and privacy?", "options": ["The automatic collection of data based on a user's continued use of a service", "Informed, voluntary, and explicit agreement by the data subject to specific data processing activities", "The legal right of a company to purchase data from a third-party broker", "The assumption of permission based on the data being publicly available on the internet", "The agreement between two companies to share customer data for marketing purposes"], "a": 1, "expl": "Informed consent is a cornerstone of ethical data collection.", "prep": "DMBOK2 Ch. 2: Consent.", "ref": "DMBOK2 Ch. 2" },
  { "id": "ET6", "cat": "ethics", "q": "De-identification is the process of:", "options": ["Removing or obfuscating Personally Identifiable Information (PII) to protect privacy", "Deleting inactive user accounts from the system after a specified period", "Assigning unique surrogate keys to replace natural business keys", "Verifying a user's identity through multi-factor authentication", "Tracking and logging all user activity within a database"], "a": 0, "expl": "Stripping identifiers to protect privacy.", "prep": "DMBOK2 Ch. 2.", "ref": "DMBOK2 Ch. 2" },
  { "id": "DS1", "cat": "science", "q": "The '3 Vs' defining Big Data are:", "options": ["Value, Vision, and Velocity", "Volume, Velocity, and Variety", "Virtualization, Visualization, and Validation", "Verification, Validation, and Value", "Volatility, Vulnerability, and Volume"], "a": 1, "expl": "Size (Volume), Speed (Velocity), Shape (Variety).", "prep": "DMBOK2 Ch. 14: 3Vs.", "ref": "DMBOK2 Ch. 14" },
  { "id": "DS2", "cat": "science", "q": "Schema-on-Read means:", "options": ["The data structure is strictly defined and enforced before data is loaded into the repository", "The structure and meaning are applied only when the data is queried or analyzed", "The data is completely unstructured and cannot be queried using SQL", "The data is stored in a read-only format to prevent unauthorized modifications", "The schema is automatically deleted immediately after the data is read"], "a": 1, "expl": "Data Lake characteristic. Load raw, define structure later.", "prep": "DMBOK2 Ch. 14.", "ref": "DMBOK2 Ch. 14" },
  { "id": "DS3", "cat": "science", "q": "Supervised Learning in Machine Learning relies on:", "options": ["Labeled training data containing known input-output pairs", "Unlabeled data where the algorithm must discover hidden patterns independently", "Randomly generated noise to test the robustness of the model", "A predefined set of rigid, rule-based programming logic", "Continuous feedback from a human operator during every prediction"], "a": 0, "expl": "Supervised = Teaching with examples (Labels). Unsupervised = Finding patterns.", "prep": "DMBOK2 Ch. 14: ML.", "ref": "DMBOK2 Ch. 14" },
  { "id": "DS4", "cat": "science", "q": "Data Wrangling (or Munging) is best described as:", "options": ["The process of securing data centers against physical threats", "Cleaning, transforming, and mapping raw data into a usable format for downstream analysis", "The automated archiving of historical data to cheaper storage tiers", "The process of designing interactive dashboards for executive reporting", "Compressing large datasets to reduce network transmission times"], "a": 1, "expl": "Data Munging/Preparation for analytics.", "prep": "DMBOK2 Ch. 14.", "ref": "DMBOK2 Ch. 14" },
  { "id": "DS5", "cat": "science", "q": "In data visualization, 'Chart Junk' refers to:", "options": ["Data points that are statistically insignificant outliers", "Unnecessary visual elements (e.g., 3D effects, heavy gridlines) that distract from the core message", "The use of pie charts, which are universally discouraged by data scientists", "A dashboard that contains too many different types of charts", "Visualizations that fail to include proper axis labels and legends"], "a": 1, "expl": "Visual noise/clutter in dataviz.", "prep": "DMBOK2 Ch. 14: Viz.", "ref": "DMBOK2 Ch. 14" },
  { "id": "DS6", "cat": "science", "q": "MapReduce is a programming model designed for:", "options": ["Processing small, highly structured datasets in memory", "Distributed processing of large datasets across clusters of commodity hardware", "Rendering complex geographic maps and spatial data", "Reducing the physical storage footprint of image and video files", "Executing single-threaded, sequential batch jobs"], "a": 1, "expl": "Hadoop processing model (Map = split, Reduce = aggregate).", "prep": "DMBOK2 Ch. 14.", "ref": "DMBOK2 Ch. 14" },
  { "id": "DS7", "cat": "science", "q": "A Data Scientist primarily focuses on:", "options": ["Installing, configuring, and tuning database management systems", "Predictive modeling, statistical analysis, and developing advanced machine learning algorithms", "Designing the physical schema for the enterprise data warehouse", "Managing the daily execution of ETL batch jobs", "Creating standard operational reports for business users"], "a": 1, "expl": "Advanced analytics vs Data Engineering or DBA work.", "prep": "DMBOK2 Ch. 14.", "ref": "DMBOK2 Ch. 14" },
  { "id": "DS8", "cat": "science", "q": "Sentiment Analysis is an application of:", "options": ["Natural Language Processing (NLP)", "Computer Vision and Image Recognition", "Structured SQL Querying and Aggregation", "Extract, Transform, Load (ETL) processing", "Database Indexing and Query Optimization"], "a": 0, "expl": "Analyzing text to determine emotion/intent.", "prep": "DMBOK2 Ch. 14.", "ref": "DMBOK2 Ch. 14" }
]
