[
  { "id": "N56", "cat": "modeling", "q": "Optionality in a data model describes:", "options": ["Whether a relationship is required (Mandatory vs Optional)", "The choice of which physical database management system to use", "The ability of a user to opt-out of data collection", "Whether a specific attribute should be indexed for performance", "The selection of surrogate keys versus natural keys"], "a": 0, "expl": "Minimum cardinality (0 or 1).", "prep": "DMBOK2 Ch. 5.", "ref": "DMBOK2 Ch. 5" },
  { "id": "N57", "cat": "quality", "q": "Data Quality Assessment primarily involves:", "options": ["Measuring the current state of data against defined business requirements", "Automatically fixing identified data anomalies in the source system", "Deleting records that fail to meet minimum quality thresholds", "Estimating the financial cost of poor data quality without empirical data", "Ignoring minor data defects to focus on system performance"], "a": 0, "expl": "Measurement.", "prep": "DMBOK2 Ch. 13.", "ref": "DMBOK2 Ch. 13" },
  { "id": "N58", "cat": "quality", "q": "A Data Quality Strategy is best described as:", "options": ["A long-term plan outlining the approach for continuous data quality improvement", "A specific software tool purchased to automate data profiling", "A centralized database used exclusively for storing data quality metrics", "A dedicated Data Steward responsible for manual data entry review", "A single SQL query used to identify duplicate customer records"], "a": 0, "expl": "Long-term plan.", "prep": "DMBOK2 Ch. 13.", "ref": "DMBOK2 Ch. 13" },
  { "id": "N59", "cat": "security", "q": "Vulnerability Scanning is defined as:", "options": ["The automated, systematic inspection of systems to identify known security weaknesses", "The manual attempt by ethical hackers to breach a system's defenses", "The physical inspection of server hardware for tampering", "The process of writing secure code during the software development lifecycle", "The permanent deletion of compromised files from a network drive"], "a": 0, "expl": "Automated scan.", "prep": "DMBOK2 Ch. 7.", "ref": "DMBOK2 Ch. 7" },
  { "id": "N60", "cat": "security", "q": "A Security Audit is:", "options": ["A formal, independent verification that security controls are implemented and functioning correctly", "The daily routine of checking employee emails for phishing attempts", "The procurement process for purchasing new antivirus software", "The hiring of physical security guards for the data center", "The routine cleaning and maintenance of office IT equipment"], "a": 0, "expl": "Formal review.", "prep": "DMBOK2 Ch. 7.", "ref": "DMBOK2 Ch. 7" },
  { "id": "N61", "cat": "mdm", "q": "Data Stewardship in the context of MDM typically involves:", "options": ["Resolving complex match/merge issues and defining business rules for survivorship", "Writing the ETL code required to populate the MDM hub", "Installing and configuring the physical servers hosting the MDM software", "Selling the organization's master data to third-party vendors", "Managing the human resources policies for the IT department"], "a": 0, "expl": "Manual resolution.", "prep": "DMBOK2 Ch. 10.", "ref": "DMBOK2 Ch. 10" },
  { "id": "N62", "cat": "mdm", "q": "Code Cross-Walking is the process of:", "options": ["Mapping and translating reference data codes between disparate systems", "Physically transporting backup tapes across different data center locations", "Writing custom software code to bypass security firewalls", "Deleting obsolete source code from the enterprise repository", "Encrypting application source code to protect intellectual property"], "a": 0, "expl": "Mapping values.", "prep": "DMBOK2 Ch. 10.", "ref": "DMBOK2 Ch. 10" },
  { "id": "N63", "cat": "dwbi", "q": "In Business Intelligence, a Dashboard is:", "options": ["A visual display of key performance indicators (KPIs) consolidated on a single screen", "A physical component of a server rack used for monitoring temperature", "A specific type of relational database table optimized for fast writes", "A complex SQL script used to extract data from the operational data store", "The administrative interface used by DBAs to manage user permissions"], "a": 0, "expl": "Visualization.", "prep": "DMBOK2 Ch. 11.", "ref": "DMBOK2 Ch. 11" },
  { "id": "N64", "cat": "dwbi", "q": "A Scorecard differs from a Dashboard primarily because it:", "options": ["Measures performance against specific, predefined strategic targets or goals", "Is used exclusively to track the outcomes of sporting events", "Calculates the financial creditworthiness of a customer", "Is a printed document rather than an interactive digital display", "Only displays data that has been fully normalized to 3NF"], "a": 0, "expl": "Target tracking.", "prep": "DMBOK2 Ch. 11.", "ref": "DMBOK2 Ch. 11" },
  { "id": "N65", "cat": "metadata", "q": "Technical Lineage focuses on:", "options": ["The system-level flow of data, including ETL transformations and physical table mappings", "The flow of business definitions and terminology across different departments", "The historical record of which users have accessed a specific database", "The financial cost associated with storing and processing the data", "The strategic roadmap for future data architecture enhancements"], "a": 0, "expl": "System flow.", "prep": "DMBOK2 Ch. 12.", "ref": "DMBOK2 Ch. 12" },
  { "id": "N66", "cat": "metadata", "q": "Business Lineage focuses on:", "options": ["The flow of business meaning, terminology, and conceptual relationships across the enterprise", "The physical routing of network cables between different server racks", "The tracking of IP addresses used to access the corporate network", "The calculation of physical file sizes and storage capacity requirements", "The optimization of database indexes for faster query performance"], "a": 0, "expl": "Meaning flow.", "prep": "DMBOK2 Ch. 12.", "ref": "DMBOK2 Ch. 12" },
  { "id": "N67", "cat": "content", "q": "Enterprise Content Management (ECM) encompasses:", "options": ["Strategies, methods, and tools used to capture, manage, and preserve unstructured content", "The administration of structured relational database management systems (RDBMS)", "The configuration and monitoring of enterprise network infrastructure", "The procurement and lifecycle management of physical IT hardware", "The recruitment and training of data management personnel"], "a": 0, "expl": "Unstructured strategy.", "prep": "DMBOK2 Ch. 9.", "ref": "DMBOK2 Ch. 9" },
  { "id": "N68", "cat": "content", "q": "A Retention Policy defines:", "options": ["The legal and regulatory rules for how long records must be kept and when they should be destroyed", "The criteria for hiring and retaining top talent within the data governance team", "The formula used to calculate employee bonuses based on data quality metrics", "The access control rules determining which users can view sensitive data", "The firewall configurations that prevent unauthorized network access"], "a": 0, "expl": "Lifecycle rules.", "prep": "DMBOK2 Ch. 9.", "ref": "DMBOK2 Ch. 9" },
  { "id": "N69", "cat": "ethics", "q": "Ethical Risk in data management primarily concerns:", "options": ["The risk of causing harm to individuals or society through the misuse of data", "The financial risk of exceeding the budget for a new data warehouse project", "The security risk of a hacker breaching the corporate firewall", "The risk of hardware failure resulting in permanent data loss", "The risk of network latency impacting real-time application performance"], "a": 0, "expl": "Harm to subjects.", "prep": "DMBOK2 Ch. 2.", "ref": "DMBOK2 Ch. 2" },
  { "id": "N70", "cat": "ethics", "q": "Data Ownership, from an ethical perspective, involves:", "options": ["The rights, duties, and responsibilities regarding the collection and use of personal data", "The physical possession of the hard drives where the data is stored", "The legal purchase of a software license for a database management system", "The requirement for every user to have a unique, complex password", "The assignment of a system administrator to manage database backups"], "a": 0, "expl": "Rights/Duties.", "prep": "DMBOK2 Ch. 2.", "ref": "DMBOK2 Ch. 2" },
  { "id": "N71", "cat": "science", "q": "Descriptive Analytics is designed to answer which question?", "options": ["What happened?", "Why did it happen?", "What will happen?", "How can we make it happen?", "Who is responsible?"], "a": 0, "expl": "Hindsight.", "prep": "DMBOK2 Ch. 14.", "ref": "DMBOK2 Ch. 14" },
  { "id": "N72", "cat": "science", "q": "Diagnostic Analytics is designed to answer which question?", "options": ["Why did it happen?", "What happened?", "What will happen?", "How can we make it happen?", "Where did it happen?"], "a": 0, "expl": "Insight/Root cause.", "prep": "DMBOK2 Ch. 14.", "ref": "DMBOK2 Ch. 14" },
  { "id": "N73", "cat": "governance", "q": "The 'DAMA Wheel' illustrates:", "options": ["The core Knowledge Areas of Data Management and their relationship to Data Governance", "The physical components of a magnetic hard disk drive", "A gamified approach to training new data stewards", "The recommended color palette for designing business intelligence dashboards", "A pie chart showing the typical distribution of enterprise data types"], "a": 0, "expl": "Framework.", "prep": "DMBOK2 Ch. 1.", "ref": "DMBOK2 Ch. 1" },
  { "id": "N74", "cat": "governance", "q": "Data Management is defined as:", "options": ["The development, execution, and supervision of plans, policies, programs, and practices that control data assets", "The physical repair and maintenance of computer hardware and servers", "The act of writing software code to build new business applications", "The installation and configuration of the Windows operating system", "The exclusive management of human resources within the IT department"], "a": 0, "expl": "Definition.", "prep": "DMBOK2 Ch. 1.", "ref": "DMBOK2 Ch. 1" },
  { "id": "N75", "cat": "architecture", "q": "Current State Architecture is also known as:", "options": ["The 'As-Is' Architecture", "The 'To-Be' Architecture", "The 'Was' Architecture", "The 'Could-Be' Architecture", "The 'Never' Architecture"], "a": 0, "expl": "As-Is.", "prep": "DMBOK2 Ch. 4.", "ref": "DMBOK2 Ch. 4" },
  { "id": "N76", "cat": "architecture", "q": "Target State Architecture is also known as:", "options": ["The 'To-Be' Architecture", "The 'As-Is' Architecture", "The 'Was' Architecture", "The 'Maybe' Architecture", "The 'Never' Architecture"], "a": 0, "expl": "To-Be.", "prep": "DMBOK2 Ch. 4.", "ref": "DMBOK2 Ch. 4" },
  { "id": "N77", "cat": "modeling", "q": "The primary goal of Database Normalization is to:", "options": ["Reduce data redundancy and prevent update anomalies", "Increase the physical size of the database to utilize available storage", "Slow down the execution of complex analytical queries", "Intentionally duplicate data to improve read performance", "Confuse unauthorized users by fragmenting the data structure"], "a": 0, "expl": "Efficiency.", "prep": "DMBOK2 Ch. 5.", "ref": "DMBOK2 Ch. 5" },
  { "id": "N78", "cat": "modeling", "q": "The primary goal of Database Denormalization is to:", "options": ["Improve read performance by reducing the number of required table joins", "Save physical storage space on the database server", "Reduce data redundancy and improve data integrity", "Ensure strict adherence to the Third Normal Form (3NF)", "Permanently remove obsolete data from the system"], "a": 0, "expl": "Read speed.", "prep": "DMBOK2 Ch. 5.", "ref": "DMBOK2 Ch. 5" },
  { "id": "N79", "cat": "quality", "q": "A Data Quality Issue Log is used to:", "options": ["Track, monitor, and manage reported data defects through to resolution", "Log the timestamps of all user logins to the data warehouse", "Record all hardware and software errors generated by the database server", "Archive all incoming and outgoing corporate emails", "Maintain a record of all customer service phone calls"], "a": 0, "expl": "Defect tracking.", "prep": "DMBOK2 Ch. 13.", "ref": "DMBOK2 Ch. 13" },
  { "id": "N80", "cat": "quality", "q": "Data Remediation is the process of:", "options": ["Correcting or fixing identified data quality issues", "Discovering new data quality issues through profiling", "Intentionally ignoring minor data defects to save time", "Creating synthetic data issues to test the system's resilience", "Generating reports that highlight data quality failures"], "a": 0, "expl": "Fixing.", "prep": "DMBOK2 Ch. 13.", "ref": "DMBOK2 Ch. 13" },
  { "id": "N81", "cat": "security", "q": "Encryption Key Management involves:", "options": ["The secure generation, storage, distribution, and destruction of cryptographic keys", "The intentional loss of keys to prevent data access during a legal dispute", "Sharing encryption keys publicly to promote open-source collaboration", "Writing encryption keys on paper and storing them in a physical safe", "Deleting all encryption keys to improve database performance"], "a": 0, "expl": "Key security.", "prep": "DMBOK2 Ch. 7.", "ref": "DMBOK2 Ch. 7" },
  { "id": "N82", "cat": "security", "q": "Social Engineering is a security threat that involves:", "options": ["Manipulating individuals into divulging confidential information or performing actions", "Building physical bridges and infrastructure to support data centers", "Writing malicious code to exploit software vulnerabilities", "Installing unauthorized network devices to intercept traffic", "Designing complex database schemas to hide sensitive data"], "a": 0, "expl": "Human hacking.", "prep": "DMBOK2 Ch. 7.", "ref": "DMBOK2 Ch. 7" },
  { "id": "N83", "cat": "mdm", "q": "The concept of a 'Single Version of the Truth' is:", "options": ["A primary goal of Master Data Management and Data Warehousing", "A recognized fallacy that cannot be achieved in modern enterprises", "A backup strategy that relies on a single tape drive", "The practice of storing all raw data in an unstructured data lake", "The use of unstructured data for all business reporting"], "a": 0, "expl": "Unified view.", "prep": "DMBOK2 Ch. 10.", "ref": "DMBOK2 Ch. 10" },
  { "id": "N84", "cat": "mdm", "q": "A 'Trusted Source' or 'System of Record' is:", "options": ["A system recognized as the authoritative and verified source for specific data elements", "An open-source encyclopedia like Wikipedia used for reference data", "Information gathered from unverified industry rumors or social media", "A file that has been recently recovered from the recycling bin", "Any public website that provides free datasets"], "a": 0, "expl": "Verification.", "prep": "DMBOK2 Ch. 10.", "ref": "DMBOK2 Ch. 10" },
  { "id": "N85", "cat": "dwbi", "q": "In dimensional modeling, a Fact Table primarily contains:", "options": ["Numerical measures (metrics) and foreign keys linking to dimension tables", "Long, descriptive text fields and qualitative comments", "System configuration settings and application parameters", "A list of authorized users and their encrypted passwords", "System audit logs and error tracking information"], "a": 0, "expl": "Measures.", "prep": "DMBOK2 Ch. 11.", "ref": "DMBOK2 Ch. 11" },
  { "id": "N86", "cat": "dwbi", "q": "In dimensional modeling, a Dimension Table primarily contains:", "options": ["Descriptive attributes that provide context for the numerical measures", "The core numerical metrics and performance indicators", "Empty columns reserved for future data expansion", "Highly sensitive trade secrets and intellectual property", "Only the primary and foreign keys necessary for table joins"], "a": 0, "expl": "Context.", "prep": "DMBOK2 Ch. 11.", "ref": "DMBOK2 Ch. 11" },
  { "id": "N87", "cat": "metadata", "q": "Passive Metadata is typically:", "options": ["Created during design-time and used primarily for documentation purposes", "Generated at run-time and used to control system behavior", "Actively updated by the system without human intervention", "Dynamic and constantly changing based on user interactions", "Executable code that performs data transformations"], "a": 0, "expl": "Documentation.", "prep": "DMBOK2 Ch. 12.", "ref": "DMBOK2 Ch. 12" },
  { "id": "N88", "cat": "metadata", "q": "Active Metadata is typically:", "options": ["Used to drive system behavior and automate processes at run-time", "Static documentation that is rarely updated after the system is built", "Stored exclusively in offline, paper-based manuals", "Printed out and distributed to business users for reference", "Slow to access and difficult to integrate with operational systems"], "a": 0, "expl": "Automated/Dynamic.", "prep": "DMBOK2 Ch. 12.", "ref": "DMBOK2 Ch. 12" },
  { "id": "N89", "cat": "content", "q": "Version Control in document management is the process of:", "options": ["Tracking and managing changes to documents over time to maintain a history", "Permanently deleting older versions of documents to save storage space", "Printing physical copies of documents for archival purposes", "Scanning paper documents into a digital format using OCR", "Emailing documents to a distribution list for review"], "a": 0, "expl": "History tracking.", "prep": "DMBOK2 Ch. 9.", "ref": "DMBOK2 Ch. 9" },
  { "id": "N90", "cat": "content", "q": "An Audit Trail provides:", "options": ["A chronological log of who accessed or modified data and when the action occurred", "A physical walking path designed for security patrols in a data center", "A financial record used exclusively for tracking corporate expenses", "A paper-based record of all database schema changes", "An email distribution list used for security alerts"], "a": 0, "expl": "History log.", "prep": "DMBOK2 Ch. 9.", "ref": "DMBOK2 Ch. 9" },
  { "id": "N91", "cat": "ethics", "q": "A Fiduciary Duty in the context of data ethics implies:", "options": ["A legal and ethical obligation to act in the best interest of the data subject", "A duty to maximize corporate profits regardless of the impact on user privacy", "An obligation to write efficient code to reduce computing costs", "A duty to attempt to hack into competitor systems to gather intelligence", "An obligation to ignore minor data breaches to protect the company's reputation"], "a": 0, "expl": "Trust obligation.", "prep": "DMBOK2 Ch. 2.", "ref": "DMBOK2 Ch. 2" },
  { "id": "N92", "cat": "ethics", "q": "Transparency in data ethics refers to:", "options": ["Openness and clarity about how an organization collects, uses, and shares data", "The use of invisible tracking pixels to monitor user behavior", "Maintaining strict secrecy regarding the algorithms used for data analysis", "Increasing the complexity of privacy policies to protect the company legally", "The speed at which data is processed and made available to users"], "a": 0, "expl": "Openness.", "prep": "DMBOK2 Ch. 2.", "ref": "DMBOK2 Ch. 2" },
  { "id": "N93", "cat": "science", "q": "Machine Learning is a subset of AI focused on:", "options": ["Systems that learn and improve from data without being explicitly programmed", "The manual coding of complex, rule-based expert systems", "The manual entry of data into a relational database", "The physical repair and maintenance of computer hardware", "The configuration of network routers and switches"], "a": 0, "expl": "Learning algorithms.", "prep": "DMBOK2 Ch. 14.", "ref": "DMBOK2 Ch. 14" },
  { "id": "N94", "cat": "science", "q": "Artificial Intelligence (AI) broadly refers to:", "options": ["The simulation of human intelligence processes by machines, especially computer systems", "The biological study of human thought and cognition", "The study of animal behavior and intelligence", "Theoretical concepts regarding extraterrestrial intelligence", "Systems that operate entirely without any form of logic or reasoning"], "a": 0, "expl": "Machine intelligence.", "prep": "DMBOK2 Ch. 14.", "ref": "DMBOK2 Ch. 14" },
  { "id": "N95", "cat": "integration", "q": "Batch Processing involves:", "options": ["Processing large volumes of data in chunks at scheduled intervals", "Processing individual data transactions immediately as they occur", "The instantaneous transfer of data between two systems", "The manual entry of data by a human operator", "A process that never executes unless manually triggered by an administrator"], "a": 0, "expl": "Scheduled chunks.", "prep": "DMBOK2 Ch. 8.", "ref": "DMBOK2 Ch. 8" },
  { "id": "N96", "cat": "integration", "q": "Real-time Processing involves:", "options": ["The immediate processing of data as soon as it is generated or received", "Processing data overnight when system resources are readily available", "Processing data on a weekly schedule to generate summary reports", "Processing data on a monthly basis for financial reconciliation", "A process that never executes unless manually triggered by an administrator"], "a": 0, "expl": "Immediate.", "prep": "DMBOK2 Ch. 8.", "ref": "DMBOK2 Ch. 8" },
  { "id": "N97", "cat": "governance", "q": "A Mission Statement defines:", "options": ["The fundamental purpose and current focus of the organization or program", "The detailed technical specifications for a new software application", "The visual design and branding guidelines for the corporate logo", "The physical address of the corporate headquarters", "The contact phone numbers for the IT helpdesk"], "a": 0, "expl": "Purpose.", "prep": "DMBOK2 Ch. 3.", "ref": "DMBOK2 Ch. 3" },
  { "id": "N98", "cat": "governance", "q": "A Vision Statement defines:", "options": ["The desired future state or long-term goal of the organization or program", "The current operational status and daily activities of the team", "The historical background and founding story of the company", "A formal complaint submitted by a customer regarding data privacy", "An itemized invoice for data management software licenses"], "a": 0, "expl": "Future goal.", "prep": "DMBOK2 Ch. 3.", "ref": "DMBOK2 Ch. 3" },
  { "id": "N99", "cat": "architecture", "q": "System Architecture describes:", "options": ["The structure, components, and relationships of a specific IT system", "The architectural design of the physical office building", "The urban planning and layout of the city where the data center is located", "The high-level business plan and marketing strategy", "The logical data model representing business entities"], "a": 0, "expl": "System structure.", "prep": "DMBOK2 Ch. 4.", "ref": "DMBOK2 Ch. 4" },
  { "id": "N100", "cat": "modeling", "q": "A Data Type defines:", "options": ["The format and constraints of a data value (e.g., Integer, VARCHAR, Date)", "The total physical storage size allocated for the entire database", "The specific business value or meaning of the data", "The individual who is designated as the Data Owner", "The business name assigned to a specific data element"], "a": 0, "expl": "Format definition.", "prep": "DMBOK2 Ch. 5.", "ref": "DMBOK2 Ch. 5" },
  { "id": "N101", "cat": "quality", "q": "In data quality, Precision refers to:", "options": ["The level of detail or granularity of the data (e.g., number of decimal places)", "The degree to which the data accurately reflects the real-world object", "The absolute truthfulness of the data regardless of context", "The speed at which the data can be retrieved from the database", "The physical size of the data file in megabytes"], "a": 0, "expl": "Granularity.", "prep": "DMBOK2 Ch. 13.", "ref": "DMBOK2 Ch. 13" },
  { "id": "N102", "cat": "security", "q": "Disaster Recovery focuses on:", "options": ["The processes and technologies used to restore IT systems and data after a catastrophic failure", "The proactive measures taken to prevent a system failure from occurring", "The intentional sabotage of systems to test their resilience", "The decision to ignore minor system failures to save money", "The permanent deletion of systems that are no longer needed"], "a": 0, "expl": "Restoration.", "prep": "DMBOK2 Ch. 7.", "ref": "DMBOK2 Ch. 7" },
  { "id": "N103", "cat": "mdm", "q": "A System of Record is:", "options": ["The authoritative, trusted source system for a specific data element", "A secondary backup system used only in the event of a disaster", "A temporary cache used to speed up database queries", "A user's local laptop where they store downloaded reports", "An email inbox where data extracts are frequently sent"], "a": 0, "expl": "Authoritative.", "prep": "DMBOK2 Ch. 10.", "ref": "DMBOK2 Ch. 10" },
  { "id": "N104", "cat": "dwbi", "q": "A Grain Statement in dimensional modeling defines:", "options": ["Exactly what a single row in a fact table represents", "The type of food served in the corporate cafeteria", "The physical texture of the server hardware", "The type of wood used to build the data center desks", "The specific metal alloys used in the network cables"], "a": 0, "expl": "Row definition.", "prep": "DMBOK2 Ch. 11.", "ref": "DMBOK2 Ch. 11" },
  { "id": "N105", "cat": "metadata", "q": "A Data Dictionary is primarily:", "options": ["A detailed list of data elements, their attributes, and technical specifications", "A book used to check the spelling of business terms", "A tool used to translate data from one language to another", "A directory of employee phone numbers and contact information", "A comprehensive encyclopedia of general business knowledge"], "a": 0, "expl": "Element list.", "prep": "DMBOK2 Ch. 12.", "ref": "DMBOK2 Ch. 12" },
  { "id": "N106", "cat": "content", "q": "Classification in content management involves:", "options": ["Categorizing content based on its subject matter, sensitivity, or retention requirements", "The permanent deletion of content that is no longer needed", "The process of writing new content for the corporate website", "The act of reading and reviewing content for grammatical errors", "The process of selling digital content to external customers"], "a": 0, "expl": "Categorization.", "prep": "DMBOK2 Ch. 9.", "ref": "DMBOK2 Ch. 9" },
  { "id": "N107", "cat": "ethics", "q": "A Code of Ethics provides:", "options": ["A set of principles and guidelines governing professional behavior and decision-making", "The specific Java code used to implement security controls", "A secret cryptographic code used to encrypt sensitive data", "A scannable bar code used to track physical IT assets", "A postal zip code used to route physical mail"], "a": 0, "expl": "Behavior principles.", "prep": "DMBOK2 Ch. 2.", "ref": "DMBOK2 Ch. 2" },
  { "id": "N108", "cat": "science", "q": "Data Visualization is the process of:", "options": ["Creating graphical representations of data to communicate insights clearly", "Looking out a window to observe physical phenomena", "The act of dreaming or imagining future scenarios", "Reading plain text reports to understand business performance", "Listening to audio recordings of customer service calls"], "a": 0, "expl": "Graphics.", "prep": "DMBOK2 Ch. 14.", "ref": "DMBOK2 Ch. 14" },
  { "id": "N109", "cat": "governance", "q": "A Stakeholder in data governance is:", "options": ["Any person or group with a vested interest in the outcome of data management activities", "A person responsible for holding the physical servers in place", "A carpenter who builds the desks for the data governance team", "The driver of the delivery truck that transports backup tapes", "The pilot of the corporate jet used by the Chief Data Officer"], "a": 0, "expl": "Interested party.", "prep": "DMBOK2 Ch. 3.", "ref": "DMBOK2 Ch. 3" },
  { "id": "N110", "cat": "architecture", "q": "An Architectural Blueprint is:", "options": ["A detailed plan or design document outlining the structure of a system", "A specific type of blue paint used in data center construction", "A physical printout of a database query result", "A photograph of the IT team", "A rough, hand-drawn sketch of a new software feature"], "a": 0, "expl": "Plan.", "prep": "DMBOK2 Ch. 4.", "ref": "DMBOK2 Ch. 4" }
]
